{
  "departments": [{
      "title": "Engineering",
      "path": "engineering",
      "positions": [
        {
          "title": "JS Full Stack Developer - Integration Team",
          "location": "Remote",
          "path": "js-frontend-developer-integration-team",
          "description": "We're looking for a Full Stack Developer to develop product interfaces for the different Hermez integrations with our partners’ applications. You'll work with different engineering teams to design, spec, and implement Web Apps and APIs that showcase the potential of the Hermez network, as well as optimizing and improving the backend to adapt to new requirements.",
          "responsabilities": [
            "Design and implement quality frontend and backend architectures that connect with blockchain platforms like Hermez and Ethereum.",
            "Work with our design, product teams and partners to transform ideas and designs into great products.",
            "Develop high-quality, performant, modern, clean and readable code within tight deadlines.",
            "Take ownership of the development and maintenance of the project from ideation to deployment.",
            "Work with the engineering, design, and product teams collaboratively, contributing ideas that add value to our product roadmap and company goals."
          ],
          "skills": [
            "Minimum 3 years experience in software development.",
            "Strong experience in designing and implementing quality apps.",
            "Experience working with modern JavaScript tools like ES6+, Vue, React, Angular development tools, and service APIs.",
            "Working knowledge of web3, ethers, truffle and/or hardhat is a plus.",
            "Passion about privacy and decentralization.",
            "Develop high-quality, performant, modern, clean and readable code.",
            "Good written and verbal communication skills in English."
          ],
          "niceToHave": [
            "Experienced working in projects using cryptography, complex maths and complex database structures.",
            "Experienced in designing blockchain architectures.",
            "Familiar with existing L2 blockchain solutions.",
            "Familiar with Zero-Knowledge algorithms.",
            "Familiar with devOps stack."
          ]
        },
        {
          "title": "Blockchain JS Engineer - Backend Protocol Team",
          "location": "Remote",
          "path": "blockchain-js-engineer-backend-protocol-team",
          "description": "We're looking for an experienced JS Blockchain Engineer to develop our core technology. You'll work with the engineering team to research, spec, and implement blockchain-based solutions that power L2 scaling solutions. In addition, as a software engineer, you will collaborate with team members in making architectural decisions.",
          "responsabilities": [
            "Participate in designing blockchain scaling architectures.",
            "Write high-quality, clean, commented and testing solidity smart contract code.",
            "Develop and maintain integration testing regarding full scaling solution.",
            "Work with the engineering and product teams collaboratively, contributing ideas that add value to our product roadmap and company goals."
          ],
          "skills": [
            "Minimum 5 years experience in software development (javascript preferred).",
            "Minimum one year experience working with backend blockchain stack: web3, ethers, truffle and/or hardhat.",
            "Minimum one-year work with Ethereum blockchain architecture and smart contract development with Solidity.",
            "Strong unit and integration testing culture. Strong attention to detail.",
            "Team player who enjoys working also independently and takes ownership of tasks end to end.",
            "Good written and verbal communication skills in English."
          ],
          "niceToHave": [
            "Experienced working in projects using cryptography, complex maths and complex database structures.",
            "Experienced in designing blockchain architectures.",
            "Familiar with existing L2 blockchain solutions.",
            "Familiar with DevOps stack.",
            "Experienced with other programming tools, especially on open source projects."
          ]
        },
        {
          "title": "Senior Go Developer - Backend Node Team",
          "location": "Remote",
          "path": "senior-backend-golang-engineer",
          "description": "We're looking for a Senior Backend Golang Engineer to develop our core technology. You'll work with the engineering team to research, spec, and implement blockchain scalability solutions that enable mass adoption. In addition, as a Backend Golang Engineer, you will collaborate with team members in making architectural decisions, choosing best practices, and bringing in new ideas.",
          "responsabilities": [
            "Design and implement quality backend architectures that connect with blockchain platforms like Hermez and Ethereum.",
            "Develop high-quality, performant, modern, clean and readable code within tight deadlines.",
            "Take ownership of the development and maintenance of the project from ideation to deployment.",
            "Work with the engineering, design, and product teams collaboratively, contributing ideas that add value to our product roadmap and company goals"
          ],
          "skills": [
            "Minimum 7-8 years experience in designing and implementing quality backend architectures.",
            "Min 2-3 years experience working with Golang.",
            "Previous experience working with SQL, noSQL Database and service APIs. Messaging services, cryptography, and GRPC are a plus.",
            "Knowledge in Ethereum blockchain. Smart Contract Development in Solidity is an advantage.",
            "Experience in taking ownership of the development and maintenance of the backend stack.",
            "Experience working with product teams to transform ideas and designs into great solutions.",
            "Develop high-quality, performant, modern, clean and readable code",
            "Previous experience working with Kanban task management framework is nice to have",
            "Good written and verbal communication skills in English"
          ],
          "niceToHave": [
            "Experienced working in projects using cryptography, complex maths and complex database structures.",
            "Experienced in designing blockchain architectures.",
            "Familiar with existing L2 blockchain solutions.",
            "Familiar with DevOps stack.",
            "Familiar with Zero-Knowledge technology."
          ]
        }
      ]
    },{
      "title": "Human Resources",
      "path": "hr",
      "positions": [
        {
          "title": "Tech Recruiter - 6 Months Maternity Cover",
          "location": "Remote",
          "path": "tech-recruiter-hr",
          "description": "We're looking for a 6 months maternity cover tech recruiter to join our growing team. You'll work with the Admin, Customer and Technical Teams to source, interview and hire the best talents across Europe and Brazil. You'll be responsible for accomplishing results through the execution and delivery of the end to end, full-cycle recruitment process for a wide range of roles. A significant portion of your efforts will be focused on recruitment marketing and sourcing while determining innovative ways to attract and engage top talent as we continue to grow",
          "responsabilities": [
            "Search and headhunt for a wide range of roles using different talent acquisition tools and techniques",
            "Interview and coordinate interviews with hiring managers and founders",
            "Partner and support managers in conversations with hiring managers",
            "Lead and energize the recruitment process, from candidate sourcing through to the offer stage",
            "Delivering great candidate experience throughout the process",
            "Play an active part in building our employer brand across Europe and Brazil",
            "Share market insights and provide new ideas to management and advise on how to attract the best talent",
            "Initiate innovative ideas regarding the hiring process",
            "Attend online hiring events"
          ],
          "skills": [
            "3+ years of recruiting experience working for a fast-paced tech startup",
            "Experience integrating and executing marketing plans into recruiting strategy",
            "You have the know-how approach to come up with creative sourcing techniques to attract the right talent and know your way around different sourcing tools like LinkedIn, social media and virtual platforms and job boards",
            "Proven experience in delivering full-cycle / end to end recruiting, you should be confident in slotting into a high performing team",
            "Demonstrated and proven ability to manage and priorities multiple requisitions/roles with an extremely high standard of accuracy and precision",
            "A keen interest in staying in the know in the Tech industry, adopting new recruitment and other recruitment tech tools",
            "Demonstrable experience in Talent Acquisition for a wide range of roles",
            "Client-focused, partnering approach with both our business leaders, hiring managers and candidates to deliver a first-class experience for all stakeholders",
            "Demonstrate curiosity and learning agility to develop a strong knowledge of our business, products and services",
            "Good written and verbal communication skills in English"
          ],
          "niceToHave": []
        }
      ]
    }
  ]
}
